Revit 2027 API
BuiltInFailures.ViewPositionFailures Class
 Failures about Viewport Positions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ViewPositionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ViewPositionFailures
Public NotInheritable Class ViewPositionFailures
public ref class ViewPositionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ViewPositionFailures = class end
The BuiltInFailures.ViewPositionFailures type exposes the following members.
Properties
Name | Description
CannotMoveViewportError |  Can't move Viewport when its placement is controlled by the assigned View Position.
CannotMoveViewportWarn |  Can't move Viewport when its placement is controlled by the assigned View Position.
CropRequiredAlignment |  Can't move Viewport when its placement is controlled by the assigned View Position.
ViewAnchorDoesNotSupportView |  The View Anchor ""%1!s!"" is not supported by view ""%2!s!"".
Top
See Also
Reference
Autodesk.Revit.DB Namespace